#pragma once
#include<iostream>
#include<conio.h>
#include<Windows.h>
#include<thread>
//#include<mmstream.h>
//#include<mmstream.h>
#pragma comment(lib,"WINMM.LIB")
using namespace std;
void powerby(void);
void bGM(void)
{
	PlaySound(TEXT("bgm.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);
}
void stopBGM(void)
{
	PlaySound(NULL, NULL, SND_FILENAME);
}
void load1(void)
{
	system("cls");
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+ ____      _   __  __                             For Windows +" << endl;
	cout << "+|  _ \\ ___| |_|  \\/  | __ _ _ __   __ _  __ _  ___            +" << endl;
	cout << "+| |_) / _ \\ __| |\\/| |/ _` | '_ \\ / _` |/ _` |/ _ \\           +" << endl;
	cout << "+|  __/  __/ |_| |  | | (_| | | | | (_| | (_| |  __/           +" << endl;
	cout << "+|_|   \\___|\\__|_|  |_|\\__,_|_| |_|\\__,_|\\__, |\\___|           +" << endl;
	cout << "+                                        |___/                 +" << endl;
	cout << "+[======================                      ]50%      fv1.1  +" << endl;
	cout << "+                                        author:zd,gwj,szy,jy  +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	out();
	Sleep(1000);
}
void load2(void)
{
	system("cls");
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+ ____      _   __  __                             For Windows +" << endl;
	cout << "+|  _ \\ ___| |_|  \\/  | __ _ _ __   __ _  __ _  ___            +" << endl;
	cout << "+| |_) / _ \\ __| |\\/| |/ _` | '_ \\ / _` |/ _` |/ _ \\           +" << endl;
	cout << "+|  __/  __/ |_| |  | | (_| | | | | (_| | (_| |  __/           +" << endl;
	cout << "+|_|   \\___|\\__|_|  |_|\\__,_|_| |_|\\__,_|\\__, |\\___|           +" << endl;
	cout << "+                                        |___/                 +" << endl;
	cout << "+[================================            ]75%      fv1.1  +" << endl;
	cout << "+                                        author:zd,gwj,szy,jy  +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	out();
	Sleep(1000);
}
void load3(void)
{
	system("cls");
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+ ____      _   __  __                             For Windows +" << endl;
	cout << "+|  _ \\ ___| |_|  \\/  | __ _ _ __   __ _  __ _  ___            +" << endl;
	cout << "+| |_) / _ \\ __| |\\/| |/ _` | '_ \\ / _` |/ _` |/ _ \\           +" << endl;
	cout << "+|  __/  __/ |_| |  | | (_| | | | | (_| | (_| |  __/           +" << endl;
	cout << "+|_|   \\___|\\__|_|  |_|\\__,_|_| |_|\\__,_|\\__, |\\___|           +" << endl;
	cout << "+                                        |___/                 +" << endl;
	cout << "+[=========================================== ]99%      fv1.1  +" << endl;
	cout << "+                                        author:zd,gwj,szy,jy  +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	out();
	Sleep(1000);
}
void load4(void)
{
	system("cls");
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+ ____      _   __  __                             For Windows +" << endl;
	cout << "+|  _ \\ ___| |_|  \\/  | __ _ _ __   __ _  __ _  ___            +" << endl;
	cout << "+| |_) / _ \\ __| |\\/| |/ _` | '_ \\ / _` |/ _` |/ _ \\           +" << endl;
	cout << "+|  __/  __/ |_| |  | | (_| | | | | (_| | (_| |  __/           +" << endl;
	cout << "+|_|   \\___|\\__|_|  |_|\\__,_|_| |_|\\__,_|\\__, |\\___|           +" << endl;
	cout << "+                                        |___/                 +" << endl;
	cout << "+[============================================]100%     fv1.1  +" << endl;
	cout << "+                                        author:zd,gwj,szy,jy  +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	out();
	Sleep(1000);
	powerby();
}
void authorGUI(void)
{
	powerby();
	system("cls");
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                          前端版本号                          +" << endl;
	cout << "+                            v1.1                              +" << endl;
	cout << "+                          内核版本号                          +" << endl;
	cout << "+                            v1.0                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	Sleep(2000);
	system("cls");
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                         开发者列表:                          +" << endl;
	cout << "+                       操作界面：周典                         +" << endl;
	cout << "+                      数据结构：宋哲宇                        +" << endl;
	cout << "+                     文件系统：蒋燕&管文杰                    +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	Sleep(2000);
	system("cls");
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                          特别谢明：                          +" << endl;
	cout << "+                            盛恺                              +" << endl;
	cout << "+                           龙方淞                             +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	Sleep(2000);
}
void powerby(void)
{                             //
	system("cls");
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+ power by                                                     +" << endl;
	cout << "+                   ____ __  __ ____                           +" << endl;
	cout << "+                  / ___|  \\/  |  _ \\                          +" << endl;
	cout << "+                 | |   | |\\/| | | | |                         +" << endl;
	cout << "+                 | |___| |  | | |_| |                         +" << endl;
	cout << "+                  \\____|_|  |_|____/                          +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                        author:zd,gwj,szy,jy  +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	Sleep(2000);
}
void mainMenu(void)
{
	system("cls");                         //
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+ 待操作的文件                                                 +" << endl;
	cout << "+ 1)  宠物信息                   __  __       _                +" << endl;
	cout << "+ 2)  主人信息                  |  \\/  | __ _(_)_ __           +" << endl;
	cout << "+                               | |\\/| |/ _` | | '_  \\         +" << endl;
	cout << "+                               | |  | | (_| | | | | |         +" << endl;
	cout << "+                               |_|  |_|\\__,_|_|_| |_|         +" << endl;
	cout << "+ M)  设置                                                     +" << endl;
	cout << "+ Q)  退出                                                     +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
}
void petMenu(void)
{
	system("cls");                           //
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+ 待操作的文件>>宠物                                           +" << endl;
	cout << "+ 1)  查询宠物信息                    ____      _              +" << endl;
	cout << "+ 2)  删除宠物信息                   |  _ \\ ___| |_            +" << endl;
	cout << "+ 3)  修改宠物信息                   | |_) / _ \\ __|           +" << endl;
	cout << "+ 4)  增加宠物信息                   |  __/  __/ |_            +" << endl;
	cout << "+                                    |_|   \\___|\\__|           +" << endl;
	cout << "+ M)  设置                                                     +" << endl;
	cout << "+ B)  后退                                                     +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
}
void ChangePetMenu(void)
{
	system("cls");                           //
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+ 待操作的文件>>宠物>>修改宠物信息                             +" << endl;
	cout << "+ 1)  修改寄养天数                    ____      _              +" << endl;
	cout << "+ 2)  修改寄养价格                   |  _ \\ ___| |_            +" << endl;
	cout << "+                                    | |_) / _ \\ __|           +" << endl;
	cout << "+                                    |  __/  __/ |_            +" << endl;
	cout << "+                                    |_|   \\___|\\__|           +" << endl;
	cout << "+ M)  设置                                                     +" << endl;
	cout << "+ B)  后退                                                     +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
}
void SearchPetMenu(void)
{
	system("cls");                           //
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+ 待操作的文件>>宠物>>查询宠物信息                             +" << endl;
	cout << "+ 1)  通过编号查询                    ____      _              +" << endl;
	cout << "+ 2)  通过名字查询                   |  _ \\ ___| |_            +" << endl;
	cout << "+ 3)  查询全部宠物                   | |_) / _ \\ __|           +" << endl;
	cout << "+                                    |  __/  __/ |_            +" << endl;
	cout << "+                                    |_|   \\___|\\__|           +" << endl;
	cout << "+ M)  设置                                                     +" << endl;
	cout << "+ B)  后退                                                     +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
}
void DeletePetMenu(void)
{
	system("cls");                           //
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+ 待操作的文件>>宠物>>删除宠物信息                             +" << endl;
	cout << "+ 1)  通过编号删除                    ____      _              +" << endl;
	cout << "+ 2)  通过名字删除                   |  _ \\ ___| |_            +" << endl;
	cout << "+                                    | |_) / _ \\ __|           +" << endl;
	cout << "+                                    |  __/  __/ |_            +" << endl;
	cout << "+                                    |_|   \\___|\\__|           +" << endl;
	cout << "+ M)  设置                                                     +" << endl;
	cout << "+ B)  后退                                                     +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
}
void masterMenu(void)
{
	system("cls");                 //
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+ 待操作的文件>>主人                                           +" << endl;
	cout << "+ 1)  查询全部主人信息      __  __           _                 +" << endl;
	cout << "+ 2)  花费排序             |  \\/  | __ _ ___| |_ ___ _ __      +" << endl;
	cout << "+                          | |\\/| |/ _` / __| __/ _ \\ '__|     +" << endl;
	cout << "+                          | |  | | (_| \\__ \\ ||  __/ |        +" << endl;
	cout << "+                          |_|  |_|\\__,_|___/\\__\\___|_|        +" << endl;
	cout << "+ M)  设置                                                     +" << endl;
	cout << "+ B)  后退                                                     +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
}
void settingMenu(void)
{
	system("cls");                 //
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+ 设置菜单                                                     +" << endl;
	cout << "+ P)  音乐暂停/播放                    _   _   _               +" << endl;
	cout << "+ T)  主题设置                ___  ___| |_| |_(_)_ __   __ _   +" << endl;
	cout << "+ A)  开发者列表             / __|/ _ \\ __| __| | '_ \\ / _` |  +" << endl;
	cout << "+ S)  保存                   \\__ \\  __/ |_| |_| | | | | (_| |  +" << endl;
	cout << "+                            |___/\\___|\\__|\\__|_|_| |_|\\__, |  +" << endl;
	cout << "+                                                      |___/   +" << endl;
	cout << "+ B)  后退                                                     +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
}
void settingthemeMenu(void)
{
	system("cls");                 //
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+ 设置菜单>>主题设置                                           +" << endl;
	cout << "+ 1)  经典黑白                         _   _   _               +" << endl;
	cout << "+ 2)  黑白颠倒                ___  ___| |_| |_(_)_ __   __ _   +" << endl;
	cout << "+ 3)  鲜血玫瑰               / __|/ _ \\ __| __| | '_ \\ / _` |  +" << endl;
	cout << "+ 4)  如同专家               \\__ \\  __/ |_| |_| | | | | (_| |  +" << endl;
	cout << "+ 5)  深蓝幻想               |___/\\___|\\__|\\__|_|_| |_|\\__, |  +" << endl;
	cout << "+ 6)  青青草原                                         |___/   +" << endl;
	cout << "+ B)  后退                                                     +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
}
void power(void)
{
	system("cls");

}
void error(void)
{
	system("cls");
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                    ___ _ __ _ __ ___  _ __                   +" << endl;
	cout << "+                   / _ \\ '__| '__/ _ \\| '__|                  +" << endl;
	cout << "+                  |  __/ |  | | | (_) | |                     +" << endl;
	cout << "+                   \\___|_|  |_|  \\___/|_|                     +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	Sleep(1000);
}
void success(void)
{
	system("cls");
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                ___ _   _  ___ ___ ___  ___ ___               +" << endl;
	cout << "+               / __| | | |/ __/ __/ _ \\/ __/ __|              +" << endl;
	cout << "+               \\__ \\ |_| | (_| (_|  __/\\__ \\__ \\              +" << endl;
	cout << "+               |___/\\__,_|\\___\\___\\___||___/___/              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	Sleep(1000);
}
void log1()
{
	system("cls");
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+			       提示                            +" << endl;
	cout << "+                   请输入你要操作的宠物文件名                 +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;

}
void log2()
{
	system("cls");
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+			        提示                           +" << endl;
	cout << "+                   请输入你要操作的主人文件名                 +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
}
void music()
{
	system("cls");
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                      请问您是否需要音乐                      +" << endl;
	cout << "+                              Y/N                             +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "+                                                              +" << endl;
	cout << "++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++" << endl;
}
int MusicCountrl(int bgmtimer)//音乐控制
{
	if (bgmtimer == 0)
	{
		stopBGM();
		bgmtimer = 1;
	}
	else
	{
		bGM();
		bgmtimer = 0;
	}
	return bgmtimer;
}